'''Даны целые положительные числа A и B (A > B). На отрезке длины A
размещено максимально возможное количество отрезков длины B (без наложений).
Используя операцию деления нацело, найти количество отрезков B, размещенных на
отрезке A.'''

while True:
    try:
        b = int(input("Введите целое положительное число B: "))
        a = int(input("Введите целое положительное число A выполняющее условие A > B: "))
        if a <= 0 or b <= 0:
            print("Введите корректное значение числа должны быть больше 0")

        elif a <= b:
            print("Введите корректное значение A > B")

        else:
            break

    except ValueError:
        print("Ошибка вводите только целые числа ")
c = a // b
print(f"На отрезке A размещенно: {c} отрезков B")