'''Даны целые положительные числа A и B (A > B). На отрезке длины A
размещено максимально возможное количество отрезков длины B (без наложений).
Используя операцию деления нацело, найти количество отрезков B, размещенных на
отрезке A.'''

while True:
    try:
        number_b = int(input("Введите целое положительное число B: "))
        number_a = int(input("Введите целое положительное число A: (A > B) "))
        if number_a > number_b and number_a > -1 and number_b > -1:
            result = number_a // number_b
            print(f"максимально возможное количество отрезков длины B (без наложений) {result}")
            break
        else:
            print("Введите коректное значение")
    except ValueError:
        print("Введите коректное значение")
